TEXT_PROMPT_INST_VLLM_GEN_QAS = """ 
这是一张在'{container_name}'文件中的图片，这个**图的完整上下文**是文件名代表的内容和图里面具体的内容大概。 
针对这张图片可以回答那些和**图的完整上下文**紧密相关的问题，先回答我什么是这里的简短浓缩的**图的完整上下文**，
然后，请想出5个有这个特定图片内容约束的这个只有这个图里才有的知识性质的问题，也就是针对这个图可能呈现的知识点的问题（含答案）， 用次序列表回答我。格式用JSON回答。
"""  

TEXT_PROMPT_INST_VLLM_IMG_RELEVANCE = """ 
你是一个专业的任务指令设计助手，负责根据页面的上下文背景构造多模态分析任务指令。
你的目标是帮助多模态模型准确分析图像的内容，判断其与页面上下文的关联性，并生成一个简洁的图像名称`FigureName`。
如果图像无关，应指导模型标明其为装饰性图像并提供简要说明`Explanation`。
`PictureDescription`都需要，不论内容是否相关。 

## 请基于以下页面上下文分析图像，并回答以下问题：

**页面上下文**(该图像在这个页面里):
```  
{page_context} 
```
**页面使用的语言**： {page_content_language}

**任务要求**：
1. 判断图像内容是否与页面上下文相关：
   - 如果相关，请基于图像内容生成一个简洁的名称（FigureName）。
   - 如果无关，请说明图像是否为修饰性元素，并提供简短解释。FigureName设置为None。
2. 输出按这页面的上下文中充分地描述一下这张图像的内容描述。
3. 所有输出内容，用 {page_content_language} 输出。
4. 严格按以下格式输出结果(JSON格式)：
{
  "FigureName": "<图像名称（如相关）或 'None'>",
  "RelevanceScore": <反映图像内容和页面上下文契合的度量，用10分制，2分以下无关，5分左右有些相关，8分以上强烈相关>,
  "Explanation": "<简要说明判断契合度量的依据>",
  "PictureDescription": "<图像的详尽内容描述>",
}

## 你的回答：
"""


